In [4]:
import numpy as np
import pandas as pd

## 7. 데이터 합치기와 재구성

### 7.1 멀티 인덱스

series의 멀티 인덱스

In [5]:
s = pd.Series([85, 90, 78, 92, 88, 75],
             index = [['1학년', '1학년', '1학년', '2학년', '2학년', '2학년'],
                      ['a반', 'a반', 'b반', 'a반', 'b반','b반']])
s

1학년  a반    85
     a반    90
     b반    78
2학년  a반    92
     b반    88
     b반    75
dtype: int64

In [11]:
s['1학년']
s.loc[('1학년', 'a반')]
s.loc[ ( ) ]
s.loc[('1학년', ['a반', 'b반'])]

1학년  a반    85
     a반    90
     b반    78
dtype: int64

데이터 프레임의 멀티 인덱스

In [13]:
df = pd.DataFrame([[50, 60], [70, 80], [100, 110], [120, 130]],
                 index = [['2020년', '2020년', '2021년', '2021년'],
                          ['구월점', '부평점', '구월점', '부평점'] ],
                 columns = ['제품1', '제품2'])
df

           제품1  제품2
2020년 구월점   50   60
      부평점   70   80
2021년 구월점  100  110
      부평점  120  130

In [17]:
df.loc['2020년']
df.loc[('2020년', '구월점')]
df.loc[('2020년', '구월점'), '제품2']

np.int64(60)

### 7.2 데이터 합치기

merge  
- 두개의 데이터 프레임을 하나로 합치는 함수
- 기준컬럼이 맞으면 연결

In [36]:
df1 = pd.DataFrame({'학번' : [1, 2, 4], '이름' : ['철수', '영희', '민수']})
df1

   학번  이름
0   1  철수
1   2  영희
2   4  민수

In [38]:
df2 = pd.DataFrame({'학번' : [1, 2, 3], '점수' : ['90', '85', '70']})
df2

   학번  점수
0   1  90
1   2  85
2   3  70

merge의 종류  
- inner join = 양쪽 데이터에서 공통된 부분만 가지고옴
- left join = 왼쪽 데이터는 모두 가져오고 오른쪽은 겹치는 부분만
- right join = 오른쪽 데이터는 모두 가져오고 왼쪽 겹치는 부분만
- outer join = 양쪽 데이터를 모두 가지고옴

In [30]:
pd.merge(df1, df2, on = '학번')

   학번   이름  점수
0   1   철수  90
1   2   영희  85
2   3  NaN  70

In [23]:
pd.merge(df1, df2, on = '학번', how = 'left')

   학번  이름  점수
0   1  철수  90
1   2  영희  85
2   3  민수  70

In [39]:
pd.merge(df1, df2, on = '학번', how = 'outer')

   학번   이름   점수
0   1   철수   90
1   2   영희   85
2   3  NaN   70
3   4   민수  NaN

concat  
- 여러개의 데이터를 이어붙이는 함수
- 조건없이 그냥 이어붙임
- 방향 : 위/ 아래/ 옆으로

In [40]:
df1 = pd.DataFrame({'학번' : [1, 2, 4], '이름' : ['철수', '영희', '민수']})
df2 = pd.DataFrame({'학번' : [1, 2, 3], '점수' : ['90', '85', '70']})

In [46]:
pd.concat([df1, df2], ignore_index = True)

   학번   이름   점수
0   1   철수  NaN
1   2   영희  NaN
2   4   민수  NaN
3   1  NaN   90
4   2  NaN   85
5   3  NaN   70

In [45]:
pd.concat([df1, df2], axis = 1)

   학번  이름  학번  점수
0   1  철수   1  90
1   2  영희   2  85
2   4  민수   3  70

### 7.3 데이터 재구성

피봇(pivot)  
- 행열을 바꿔서 표를 재구성하는 함수

In [49]:
df = pd.DataFrame({ '이름' : ['철수', '영희', '철수', '영희'],
                    '과목' : ['국어', '국어', '수학', '수학'],
                    '점수' : [90, 85, 80, 95]})
df

   이름  과목  점수
0  철수  국어  90
1  영희  국어  85
2  철수  수학  80
3  영희  수학  95

In [53]:
result = df.pivot(index = '이름', columns = '과목', values = '점수')
print(result.index)
print(result.columns)

Index(['영희', '철수'], dtype='object', name='이름')
Index(['국어', '수학'], dtype='object', name='과목')